tests/stresstest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.6" jmeter="2.11.20151206">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Sojobo API stresstest" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="api-key" elementType="Argument">
            <stringProp name="Argument.name">api-key</stringProp>
            <stringProp name="Argument.value">ac234f437dd3d7a5eefb79ea3ee7e01ba260ac409b72e732b38b6b4338135ab6</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="password" elementType="Argument">
            <stringProp name="Argument.name">password</stringProp>
            <stringProp name="Argument.value">miZBa6CySw7Ab6/ASOiA6Q8b</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="basic-auth" elementType="Argument">
            <stringProp name="Argument.name">basic-auth</stringProp>
            <stringProp name="Argument.value">Basic YWRtaW46bWlaQmE2Q3lTdzdBYjYvQVNPaUE2UThi</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ip" elementType="Argument">
            <stringProp name="Argument.name">ip</stringProp>
            <stringProp name="Argument.value">35.188.93.84</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">80</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1500561339000</longProp>
        <longProp name="ThreadGroup.end_time">1500561339000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">api-key</stringProp>
              <stringProp name="Header.value">${api-key}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${basic-auth}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create controller" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;controller&quot; : &quot;hacontroller&quot;,&#xd;
 &quot;type&quot; : &quot;google&quot;,&#xd;
 &quot;region&quot; : &quot;asia-east1&quot;,&#xd;
 &quot;credentials&quot;: &#xd;
{&#xd;
  &quot;type&quot;: &quot;service_account&quot;,&#xd;
  &quot;project_id&quot;: &quot;qrama-152515&quot;,&#xd;
  &quot;private_key_id&quot;: &quot;15058da77a7e64f95cca63b4d0d20100eabda6aa&quot;,&#xd;
  &quot;private_key&quot;: &quot;-----BEGIN PRIVATE KEY-----\nMIIEvwIBADANBgkqhkiG9w0BAQEFAASCBKkwggSlAgEAAoIBAQDO6XrrO9IA6CaT\nOsDF2i38sI8ksMtV4bKFB7D1IHt+Y8rq/NyGfMgULQo7T7WWU9cyExtEEk3yCCB8\nlJsXrPvU6uZb0zt5OthZd0F+/InawTtDSG6YMcUedkDDaqrtSE4PqgPmaYriEfc4\n5lALQBAb6YiriVWfgcuQTPbZwrw7FOD/EzlgRVbYy31GzgPNeYBYXfGt6J/th5Fl\nbrsQ4m5Hcht+hfDcbWzow1KTFdCErX8bg0/a+QkHHbwBOmidYp1oCahFVd40y3FK\n55ve7KeGK7ydn9cl4L+yo6S06uf7s1glHUpKv9aINz5+FaneJL9z0WpCeFVsUzu0\nV/RtSWiRAgMBAAECggEBAI63lMU0WcGuXw0mdVkDCL1GuzU/jMEMECqaB4DMiuG+\ny3QSPbm1z/u6pVgLvuCVq9UqQKBPT9wlpuLHTcKi2oEeFQ45QMh5wkjTbSW94wg0\nSEA8cawgiCpevoULyiIowU8kodQH8HfGlJN2qLdZ1MKr7k0DST/gMxyxOYMyQsss\nehRmRbRuSocdrD4JK5wh8xUWxuGCMsI978aPorOZfsgOSMRjU21jAGC1WU+JaUtm\nAvwxdg1PLgRBIpSS7x8eUYTv3VKSFLck3gxHQT1FiXj6G7j0dpMZL4Un2Z4GjfFd\ntytsXvQxYGn3Hvo9Bk5JG7I2c53k0vJs0dk3yEUKeAECgYEA53UOFuxP/c934EqH\niS+/mc6XdqFP8fVtDSQgEOM1G59jYoopNGANa3iRnoeNDYjNsaK0jXBRwwLNq6cc\ngS/Ej0bbByAJ1uLRD+86huoUQ0c8e1y9os166DCK3POZaTEST5cwS9658aRI2dIg\nlduzeLahap0ZR+GGMhdLPbkFKaECgYEA5NokKDbRfoTZ/l8rcd1fM/LOXTDs7I54\nJvH1J/le1wIkVCJY102D4LTeK7cRpfA2QU5gVjAt7Qojq72wskATteajqf06Ojyn\nGgSLum6/TKCX7JUVT9761mhYFE+q/zYHN6p4kTtirUI3DuxE0CsKLAMyAR3QZy8O\n40vDD5ESOPECgYEAygYm1SVQsLYM6S3EXZ7auzJSjA5DDGtu0wCMKJFYwpJ9mf4D\n9x47uGmVmOyx1nVpLLpao/W8t91TjZcgTzZVd8Wd2ftB+1kgp6rkx+u64fpktTx+\nnYKC2/W6zx6k8ecOF4BcfGycmmkN2WoKXSNV5HBsNfWHonEbw88HMomzEuECgYBa\noxrW4n8uQKel20N1oVtnU67vscTkG7jyk7moz1cEiNCikcfl3clxYbDsV2Eh+3VB\ngC0fdY166B0gk8w7jK1BycrgNG6vSf5Ui6Bbgik5zBDfnlwGeiWWbVUVFkh/M4LA\nRT/jJUX7oNH1kxXd7G3m6I0RbCFx/G1FEGh87dPtwQKBgQDLQnuNFNHffREMCNri\nvvOIeOlbyEf8ZmC51kpnMt6JePiDG3+lVIc81BttKwjZKuPpZicQzezQzIdZooOf\nDEhaM3BBIrWHOmAwQCru4J8ACzubDI3hQ2BDlKC6/AIrnMTUXxyqiQzo6sRsZBrw\nUN75AS8nWAwZZ/dHsDx+E/nk2w==\n-----END PRIVATE KEY-----\n&quot;,&#xd;
  &quot;client_email&quot;: &quot;pattyn@qrama-152515.iam.gserviceaccount.com&quot;,&#xd;
  &quot;client_id&quot;: &quot;107380105160486857254&quot;,&#xd;
  &quot;auth_uri&quot;: &quot;https://accounts.google.com/o/oauth2/auth&quot;,&#xd;
  &quot;token_uri&quot;: &quot;https://accounts.google.com/o/oauth2/token&quot;,&#xd;
  &quot;auth_provider_x509_cert_url&quot;: &quot;https://www.googleapis.com/oauth2/v1/certs&quot;,&#xd;
  &quot;client_x509_cert_url&quot;: &quot;https://www.googleapis.com/robot/v1/metadata/x509/pattyn%40qrama-152515.iam.gserviceaccount.com&quot;&#xd;
}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">25</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1500555065000</longProp>
        <longProp name="ThreadGroup.end_time">1500555065000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">api-key</stringProp>
              <stringProp name="Header.value">${api-key}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${basic-auth}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create model" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;model&quot;: &quot;mod${__threadNum}&quot;, &quot;credentials&quot;: &quot;admin&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers/hacontroller/models</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Deploy bundle" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;bundle&quot;: {&#xd;
	&quot;series&quot;: &quot;trusty&quot;,&#xd;
  	&quot;machines&quot;: {&#xd;
    		&quot;0&quot;: { &quot;series&quot;: &quot;trusty&quot; },&#xd;
    		&quot;1&quot;: { &quot;series&quot;: &quot;trusty&quot; },&#xd;
    		&quot;2&quot;: { &quot;series&quot;: &quot;trusty&quot; }&#xd;
  	},&#xd;
  	&quot;services&quot;: {&#xd;
    		&quot;apache-zookeeper&quot;: {&#xd;
      		&quot;charm&quot;: &quot;cs:~tengu-bot/apache-zookeeper-0&quot;,&#xd;
      		&quot;num_units&quot;: 1,&#xd;
      		&quot;to&quot;: [&quot;0&quot;]&#xd;
    		},&#xd;
    		&quot;nimbus&quot;: {&#xd;
      		&quot;charm&quot;: &quot;cs:~tengu-bot/storm-2&quot;,&#xd;
      		&quot;num_units&quot;: 1,&#xd;
      		&quot;expose&quot;: true,&#xd;
      		&quot;to&quot;: [&quot;1&quot;]&#xd;
    		},&#xd;
    		&quot;worker&quot;: {&#xd;
      		&quot;charm&quot;: &quot;cs:~tengu-bot/storm-2&quot;,&#xd;
      		&quot;num_units&quot;: 1,&#xd;
      		&quot;to&quot;: [&quot;2&quot;]&#xd;
    		}&#xd;
  	},&#xd;
  	&quot;relations&quot;: [&#xd;
    		[&quot;worker:zookeeper&quot;, &quot;apache-zookeeper:zookeeper&quot;],&#xd;
    		[&quot;nimbus:master&quot;, &quot;worker:worker&quot;],&#xd;
    		[&quot;nimbus:zookeeper&quot;, &quot;apache-zookeeper:zookeeper&quot;]&#xd;
  	]&#xd;
}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers/hacontroller/models/mod${__threadNum}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Deploy application" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;application&quot;: &quot;mysql&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers/hacontroller/models/mod${__threadNum}/applications</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">10000</stringProp>
        </ConstantTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get model info" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers/hacontroller/models/mod${__threadNum}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Destroy model" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers/hacontroller/models/mod${__threadNum}</stringProp>
          <stringProp name="HTTPSampler.method">DELETE</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="tearDown Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1500561388000</longProp>
        <longProp name="ThreadGroup.end_time">1500561388000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </PostThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">api-key</stringProp>
              <stringProp name="Header.value">${api-key}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${basic-auth}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Destroy controller" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ip}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/tengu/controllers/hacontroller</stringProp>
          <stringProp name="HTTPSampler.method">DELETE</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>